# კომენტარი
print("გამარჯობა სამყარო")

# სხვანაირი პრინტები

print("15-ის და 18-ის ჯამი")
print(15+18)

# 23-ის და 14-ის ნამრავლი, შემდეგ 120 და 8-ის სხვაობა გამრავლებული 2-ზე

print(23 * 14, (120 - 8) * 2) 

# 2 ხარისხად 8

print(2**8) # ორი ვარსკვლავი არის ახარისხება

# გაყოფა
print("განაყოფი")
print(145/24)
# მთელად გაყოფა, სხვაგან div
print("მოდულით გაყოფა")
print(20//8)

# განაყოფის ნაშთი, მოდულით გაყოფა, სხვაგან mod
print("ნაშთი")
print(20%8)

# a == b*(a // b) + a % b
print(8*(20//8)+20%8)


print("ახლა მითხარი, შენ რა გქვია? " )
name = input() # წაიკითხავს კლავიატურას და ჩადებს name-ში
print("გამარჯობა ", name)

# ასეც შეიძლება, ამ შემთხვევაში შეყვანას იგივე ხაზიდან მოითხოვს

name1 = input("რა გქვია? ")

# if (name == name1) thenqq
print("კიდევ გამარჯობა " + name + "!" )


